Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ</name>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоОрганизациям</registerRecords>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоРегионам</registerRecords>
  <attributes>
    <name>additionalInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applExaminationOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applExamPeriodTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>applSubmisionStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>auctionTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>deliveryEndDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>deliveryPlaceIndication</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>deliveryStartDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>electronicPlaceInfo</name>
    <type>
      <types>CatalogRef.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка</types>
    </type>
  </attributes>
  <attributes>
    <name>envelopeOpeningOrder</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>examinationDateTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>examinationPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>forSmallOrMiddle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>guid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>href</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>modificationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>modificationDescription</name>
    <comment>заполняется в случае внесения изменений в документы извещения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>purchaseObjectInfo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>place</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>procedure</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>publicationDateTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>publicationPlannedDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>purchaseMethodCode</name>
    <type>
      <types>CatalogRef.ГЗ_placingWay_ПодспособОпределенияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>registrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>submissionCloseDateTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>summingupPlace</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>summingupTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>version</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>initialSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>lot</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OKEI</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>purchaseObject_Строкой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>guid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ordinalNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>lotEditEnabled</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>deliveryPlaceIndication</name>
      <comment>Допустимые значения:  ¶-	GL : Указывается общее для лота - ELP : Указывается для каждой позиции лота ¶-	LC : Указывается в сведениях по участнику совместной закупки - GA : Указывается общее для организации ¶-	EP : Указывается для каждой позиции ¶</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>subject</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>deliveryPlace</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>customerQuantities</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>customer</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Разработка_GZ/src/InformationRegisters/ГЗ_ЗакупкиПоОрганизациям/ГЗ_ЗакупкиПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГЗ_ЗакупкиПоОрганизациям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_Полный</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_3Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_2Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_1Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПодачиЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/InformationRegisters/ГЗ_ЗакупкиПоРегионам/ГЗ_ЗакупкиПоРегионам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГЗ_ЗакупкиПоРегионам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодСубъектаРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_Полный</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_3Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_2Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_1Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПодачиЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр ГЗ_ЗакупкиПоОрганизациям	
	Движения.ГЗ_ЗакупкиПоОрганизациям.Записывать = Истина;
	
	// регистр ГЗ_ЗакупкиПоРегионам
	Движения.ГЗ_ЗакупкиПоРегионам.Записывать = Истина;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГЗ_ИзвещениеОПроведенииЗакупок223ФЗlot.purchaseObject КАК purchaseObject,
		|	СУММА(ГЗ_ИзвещениеОПроведенииЗакупок223ФЗlot.sum) КАК sum
		|ИЗ
		|	Документ.ГЗ_ИзвещениеОПроведенииЗакупок223ФЗ.lot КАК ГЗ_ИзвещениеОПроведенииЗакупок223ФЗlot
		|ГДЕ
		|	ГЗ_ИзвещениеОПроведенииЗакупок223ФЗlot.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ГЗ_ИзвещениеОПроведенииЗакупок223ФЗlot.purchaseObject";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.ГЗ_ЗакупкиПоОрганизациям.Добавить();
		Движение.Организация = Ссылка.Организация;
		Движение.Период = Ссылка.Дата;
		Движение.ОКПД2_Полный = ВыборкаДетальныеЗаписи.purchaseObject;
		
		МассивОКПД2 = СтрРазделить(Движение.ОКПД2_Полный, ".",Истина);
		
		Если МассивОКПД2.Количество() = 4 Тогда 
			Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			Движение.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			Движение.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
		КонецЕсли;

		Движение.ДатаОкончанияПодачиЗаявок = Ссылка.submissionCloseDateTime;
		Движение.Сумма = ВыборкаДетальныеЗаписи.sum;
		
		
		ДвижениеПоРегионам = Движения.ГЗ_ЗакупкиПоРегионам.Добавить();
		ДвижениеПоРегионам.КодСубъектаРФ = Лев(Ссылка.Организация.ИНН, 2);
		ДвижениеПоРегионам.Период=Ссылка.Дата;
		ДвижениеПоРегионам.ОКПД2_Полный = ВыборкаДетальныеЗаписи.purchaseObject;
		
		МассивОКПД2 = СтрРазделить(Движение.ОКПД2_Полный, ".",Истина);
		
		Если МассивОКПД2.Количество() = 4 Тогда 
			ДвижениеПоРегионам.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			ДвижениеПоРегионам.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			ДвижениеПоРегионам.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
		КонецЕсли;
		
		ДвижениеПоРегионам.ДатаОкончанияПодачиЗаявок = Ссылка.submissionCloseDateTime;
		ДвижениеПоРегионам.Сумма = ВыборкаДетальныеЗаписи.sum;

		
	КонецЦикла;

	

КонецПроцедуры
